trade/src/InformationRegisters/ОчередьПечати/ОчередьПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьПечати</name>
  <attributes>
    <name>Пробить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ЗаданиеНаПеревозкуРейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/ОчередьПечати/ManagerModule.bsl
Процедура ДобавитьВОчередь(Документ, Пробить=Ложь) Экспорт
	Запись= РегистрыСведений.ОчередьПечати.СоздатьМенеджерЗаписи();
	Запись.Документ= Документ;
	Запись.Подразделение= Документ.Подразделение;
	Запись.Пробить= Пробить;
	Запись.Записать(Истина);
КонецПроцедуры

Процедура УдалитьИзОчереди(Документ) Экспорт
	Запись= РегистрыСведений.ОчередьПечати.СоздатьМенеджерЗаписи();
	Запись.Документ= Документ;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
	НаборЗаписей= РегистрыСведений.ОчередьПечати.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры
